In [31]:
import numpy as np
import pandas as pd

In [32]:
df = pd.read_csv('NOTEEVENTS.csv')

C:\Users\devad\AppData\Local\Temp\ipykernel_22432\1905699193.py:1: DtypeWarning: Columns (4,5) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('NOTEEVENTS.csv')

In [33]:
df.head(5)

,ROW_ID,SUBJECT_ID,HADM_ID,CHARTDATE,CHARTTIME,STORETIME,CATEGORY,DESCRIPTION,CGID,ISERROR,TEXT
0,174,22532,167853.0,2151-08-04,NaN,NaN,Discharge summary,Report,NaN,NaN,Admission Date: [**2151-7-16**] Dischar...
1,175,13702,107527.0,2118-06-14,NaN,NaN,Discharge summary,Report,NaN,NaN,Admission Date: [**2118-6-2**] Discharg...
2,176,13702,167118.0,2119-05-25,NaN,NaN,Discharge summary,Report,NaN,NaN,Admission Date: [**2119-5-4**] D...
3,177,13702,196489.0,2124-08-18,NaN,NaN,Discharge summary,Report,NaN,NaN,Admission Date: [**2124-7-21**] ...
4,178,26880,135453.0,2162-03-25,NaN,NaN,Discharge summary,Report,NaN,NaN,Admission Date: [**2162-3-3**] D...

In [34]:
df.isna().sum()

ROW_ID               0
SUBJECT_ID           0
HADM_ID         231836
CHARTDATE            0
CHARTTIME       316566
STORETIME       836776
CATEGORY             0
DESCRIPTION          0
CGID            836776
ISERROR        2082294
TEXT                 0
dtype: int64

In [35]:
df.info

<bound method DataFrame.info of           ROW_ID  SUBJECT_ID   HADM_ID   CHARTDATE            CHARTTIME  \
0            174       22532  167853.0  2151-08-04                  NaN
1            175       13702  107527.0  2118-06-14                  NaN
2            176       13702  167118.0  2119-05-25                  NaN
3            177       13702  196489.0  2124-08-18                  NaN
4            178       26880  135453.0  2162-03-25                  NaN
...          ...         ...       ...         ...                  ...
2083175  2070657       31097  115637.0  2132-01-21  2132-01-21 03:27:00
2083176  2070658       31097  115637.0  2132-01-21  2132-01-21 09:50:00
2083177  2070659       31097  115637.0  2132-01-21  2132-01-21 16:42:00
2083178  2070660       31097  115637.0  2132-01-21  2132-01-21 18:05:00
2083179  2070661       31097  115637.0  2132-01-21  2132-01-21 18:05:00

                   STORETIME           CATEGORY DESCRIPTION     CGID  ISERROR  \
0                        NaN  Discharge summary      Report      NaN      NaN
1                        NaN  Discharge summary      Report      NaN      NaN
2                        NaN  Discharge summary      Report      NaN      NaN
3                        NaN  Discharge summary      Report      NaN      NaN
4                        NaN  Discharge summary      Report      NaN      NaN
...                      ...                ...         ...      ...      ...
2083175  2132-01-21 03:38:00      Nursing/other      Report  17581.0      NaN
2083176  2132-01-21 09:53:00      Nursing/other      Report  19211.0      NaN
2083177  2132-01-21 16:44:00      Nursing/other      Report  20104.0      NaN
2083178  2132-01-21 18:16:00      Nursing/other      Report  16023.0      NaN
2083179  2132-01-21 18:31:00      Nursing/other      Report  16023.0      NaN

                                                      TEXT
0        Admission Date:  [**2151-7-16**]       Dischar...
1        Admission Date:  [**2118-6-2**]       Discharg...
2        Admission Date:  [**2119-5-4**]              D...
3        Admission Date:  [**2124-7-21**]              ...
4        Admission Date:  [**2162-3-3**]              D...
...                                                    ...
2083175  NPN\n\n\n#1  Infant remains in RA with O2 sats...
2083176  Neonatology\nDOL #5, CGA 36 weeks.\n\nCVR: Con...
2083177  Family Meeting Note\nFamily meeting held with ...
2083178  NPN 1800\n\n\n#1 Resp: [**Known lastname 2243*...
2083179  NPN 1800\nNursing Addendum:\n[**Known lastname...

[2083180 rows x 11 columns]>

In [38]:
df.shape

(2083180, 11)

In [39]:
columns = ['ROW_ID','SUBJECT_ID','HADM_ID','TEXT']
df = pd.DataFrame(df, columns=columns)

In [40]:
df.head(5)

,ROW_ID,SUBJECT_ID,HADM_ID,TEXT
0,174,22532,167853.0,Admission Date: [**2151-7-16**] Dischar...
1,175,13702,107527.0,Admission Date: [**2118-6-2**] Discharg...
2,176,13702,167118.0,Admission Date: [**2119-5-4**] D...
3,177,13702,196489.0,Admission Date: [**2124-7-21**] ...
4,178,26880,135453.0,Admission Date: [**2162-3-3**] D...

In [41]:
df.shape

(2083180, 4)

In [42]:
df['HADM_ID'].isna().sum()

231836

In [43]:
df = df[df['HADM_ID'].notnull()]

In [44]:
df.shape

(1851344, 4)

In [46]:
len(df['TEXT'][0])

889

In [51]:
mask = (df['TEXT'].str.len() < 400)
df = df.loc[mask]

In [52]:
df.shape

(430411, 4)

In [53]:
df.to_csv('NOTEEVENTS_NEW.csv')  # Save dataframe as data.csv in the current directory

In [54]:
df.head()

,ROW_ID,SUBJECT_ID,HADM_ID,TEXT
924,611,3734,186879.0,Admission Date: [**2109-8-7**] Discharge ...
1780,1942,21126,124750.0,Admission Date: [**2200-2-10**] Discharge...
2042,2155,9554,119712.0,Admission Date: [**2198-8-6**] Discharg...
2842,2568,8970,176312.0,Admission Date: [**2123-10-25**] Discha...
3289,3142,18982,137674.0,Admission Date: [**2133-11-27**] Discha...

In [59]:
df = pd.read_csv('NOTEEVENTS_NEW.csv')

In [60]:
df.head()

,Unnamed: 0,ROW_ID,SUBJECT_ID,HADM_ID,TEXT
0,924,611,3734,186879.0,Admission Date: [**2109-8-7**] Discharge ...
1,1780,1942,21126,124750.0,Admission Date: [**2200-2-10**] Discharge...
2,2042,2155,9554,119712.0,Admission Date: [**2198-8-6**] Discharg...
3,2842,2568,8970,176312.0,Admission Date: [**2123-10-25**] Discha...
4,3289,3142,18982,137674.0,Admission Date: [**2133-11-27**] Discha...

In [61]:
df.shape

(430411, 5)

In [66]:
df['TEXT'][120001]

'Sinus rhythm. Continued ST segment elevation and increase in rate with changes\nof acute anteroseptal, lateral and apical myocardial infarction. Followup and\nclinical correlation are suggested.\nTRACING #6\n\n'

In [68]:
len(df['TEXT'])

430411

In [70]:
df2 = pd.read_csv('D_ICD_DIAGNOSES.csv')

In [71]:
df2.head()

,ROW_ID,ICD9_CODE,SHORT_TITLE,LONG_TITLE
0,174,01166,TB pneumonia-oth test,"Tuberculous pneumonia [any form], tubercle bac..."
1,175,01170,TB pneumothorax-unspec,"Tuberculous pneumothorax, unspecified"
2,176,01171,TB pneumothorax-no exam,"Tuberculous pneumothorax, bacteriological or h..."
3,177,01172,TB pneumothorx-exam unkn,"Tuberculous pneumothorax, bacteriological or h..."
4,178,01173,TB pneumothorax-micro dx,"Tuberculous pneumothorax, tubercle bacilli fou..."

In [72]:
df2.shape

(14567, 4)

In [75]:
if "TB pneumonia-oth test" in "Hire the top freelancers":
    print("Exists")
else:
    print("Does not exist")

Does not exist